app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT "reviews".* FROM "reviews" ORDER BY "reviews"."id" DESC

  def create
    @review = Review.new(review_params)

    if @review.save
---
INSERT INTO "reviews" ("shop_id", "user_id", "img", "rate", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"