app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"
---
  def index
    @shops = Shop.all

INSERT INTO "shops" ("name", "address", "city", "state", "postalcode", "country", "created_at", "updated_at", "coords") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @shop = Shop.new(shop_params)

    if @shop.save

SELECT "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def set_shop
      @shop = Shop.find(params[:id])