app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "millie"], ["password", "password"], ["created_at", "2020-08-17 16:52:58.203127"], ["updated_at", "2020-08-17 16:52:58.203127"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "rallie"], ["updated_at", "2020-08-16 21:45:30.459957"], ["id", 4]]