app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "again"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(username: params[:user][:username])

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "wallie"], ["password_digest", "$2a$12$yUsvQanbX41Eec7pI/vkHefiiZofaM8lgVHOzIQtsHF6RtUpiHFh2"], ["updated_at", "2020-08-17 22:07:13.271070"], ["id", 5]]
---
  def update
    if @user.update(user_params)